/******************************************************************************
* File Name : GSlightmap.h                       Ver : 1.00  Date : 2018-08-20
*
* Description :
*
*       ライトマップ ヘッダファイル．
*
* Author : Moriharu Ohzu.
*
******************************************************************************/
#ifndef		_GSLIGHTMAP_H_
#define		_GSLIGHTMAP_H_

#include	"GStype.h"

#ifdef __cplusplus
extern "C" {
#endif

/*=============================================================================
*
* Purpose : ライトマップの読み込み．
*
* Return  : メッシュを返す．
*
*============================================================================*/
extern GSboolean
gsLoadLightmap
(
	GSuint      id,			/* ライトマップID         */
	const char* pszFileName	/* ライトマップファイル名 */
);

/*=============================================================================
*
* Purpose : ライトマップの削除．
*
* Return  : メッシュを返す．
*
*============================================================================*/
extern void
gsDeleteLightmap
(
	GSuint      id			/* ライトマップID         */
);

/*=============================================================================
*
* Purpose : 全ライトマップを削除．
*
* Return  : メッシュを返す．
*
*============================================================================*/
extern void
gsCleanUpLightmap
(
	void
);

/*=============================================================================
*
* Purpose : ライトマップのバインド．
*
* Return  : なし．
*
*============================================================================*/
extern void
gsBindLightmap
(
	GSuint      id			/* ライトマップID         */
);

#ifdef __cplusplus
}
#endif

#endif

/********** End of File ******************************************************/
